app/controllers/skills_controller.rb

    def index
        @skills = Skill.all.order("created_at DESC")
---
SELECT "skills".* FROM "skills"  ORDER BY created_at DESC

    def show
        @skills = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ?  ORDER BY "skills"."id" ASC LIMIT 1  [["id", 6]]